Autodesk.Revit.DB.ForgeDM.CloudProject.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeDM.CloudProject.ProjectGUID
C4R Project GUID for CloudProject
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject.RootFolderId
Root Folder Id for CloudProject
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject.Name
Name for CloudProject
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject.Id
Identifier for CloudProject
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject.#ctor(System.String,System.String,System.String)
Default constructor for CloudProject.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject.#ctor(Autodesk.Revit.DB.ForgeDM.CloudProject)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudProject
Project from ForgeDM
Usable by both Revit and Collaborate add-in.
Represents Identifier of current Project.
Represents Name of current Project.
Represents Root Folder Id of current Project.
Represents C4R Project GUID of current Project.
Since:
2019